# homework 2
## №1 Создайте матрицу 5x5 со значениями 1,2,3,4 под главной диагональю. Остальные значения - нули.
```py
import numpy as np
a=np.zeros((5,5))
for i in np.arange(4):
  a[i+1,i]=a[i+1,i]+i+1
print(a)
____________________________
[[0. 0. 0. 0. 0.]
 [1. 0. 0. 0. 0.]
 [0. 2. 0. 0. 0.]
 [0. 0. 3. 0. 0.]
 [0. 0. 0. 4. 0.]]
 ```
 
 ## №2 Создайте двумерный массив 10x3, заполненный случайными значениями. В каждой строке выберите значение, наиболее близкое к 0.5.
 ```py
 import numpy as np
a=np.random.rand(10,3)
print(a)
c = abs(a-0.5)
for i in np.arange(10):
  b = np.where(c == np.min(c[i]))
  print(a[b])
  ________________________________
  [[0.56083809 0.66724911 0.12664059]
 [0.18402384 0.55435591 0.95608227]
 [0.00951859 0.81477076 0.42296666]
 [0.75067118 0.20025581 0.54625156]
 [0.84573298 0.07646321 0.37385691]
 [0.23614193 0.88745246 0.10568066]
 [0.8061088  0.41246725 0.15513925]
 [0.24888351 0.18756961 0.63020129]
 [0.07848932 0.53300091 0.81739978]
 [0.48051541 0.50871398 0.52164504]]
[0.56083809]
[0.55435591]
[0.42296666]
[0.54625156]
[0.37385691]
[0.23614193]
[0.41246725]
[0.63020129]
[0.53300091]
[0.50871398]
```
## 3.Создайте двумерный массив 6x6, заполненный случайными значениями. Сумму по каждой строке поделите на максимальный элемент из столбца с тем же индексом.

```py
import numpy as np
a=np.random.rand(6,6)
print(a)
for i in np.arange(6):
  b = np.sum(a[i])
  c = np.mean(a[:,i])
  print(b/c)
  _______________________
  [[0.28177011 0.7751307  0.56614585 0.42318749 0.16604298 0.85592711]
 [0.22570312 0.91841963 0.81922091 0.95061084 0.14984039 0.95719731]
 [0.83216929 0.16827122 0.88597226 0.0761518  0.85573423 0.54423579]
 [0.03942186 0.95300297 0.9431582  0.72327629 0.83371237 0.15758737]
 [0.10333894 0.86719397 0.39999698 0.0949002  0.37193651 0.15734697]
 [0.19003038 0.64984516 0.42397513 0.55773292 0.43724894 0.1471684 ]]
11.007447111652054
5.569416577973763
4.995756059210729
7.7501921042842
4.25234173117105
5.120125988930819
```
## 4.На примере массива x = np.array([6, 2, 0, 3, 0, 0, 5, 7, 0]) найдите максимальный элемент в массиве среди элементов, перед которыми стоит ноль.

```py
import numpy as np
x = np.array([6, 2, 0, 3, 0, 0, 5, 7, 0])
k = np.zeros(9)
j = 0
for i in np.arange(8):
  if (x[i+1] == 0) :  
    k[j] = x[i] 
    j = j+1    
m = np.min(k[0:j])
print(m)   
_________________________________________
0.0
```
## 5.Пусть заданы два массива x = np.ones(10) и i = np.array([0, 1, 2, 3, 5, 5, 5, 8]). Прибавьте единицу к тем элементам массива x, индексы которых указаны в массиве i. В случае, если некоторый индекс встретился в массиве i несколько раз, прибавьте к соответствующему элементу массива x число вхождений данного индекса в массив i.
```py
import numpy as np
x = np.ones(10) 
i = np.array([0, 1, 2, 3, 5, 5, 5, 8])
for j in np.aСколько вы можете предложить способов округлить значения в массиве до ближайшего целого?
range(8):
  x[i[j]] += 1
print(x)  
______________________________________
[2. 2. 2. 2. 1. 4. 1. 1. 2. 1.]
```

## 6.Сколько вы можете предложить способов округлить значения в массиве до ближайшего целого?
### *Два способа: **around,rint*** 
 












